---
type: LogicalOrFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# LogicalOrFilter

`Autodesk.Revit.DB.LogicalOrFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LogicalOrFilter | — | `` |
| Method | PassesFilter | — | `` |